# # Make sure we’re using the latest Homebrew
# brew update
#
# # Upgrade any already-installed formulae
# brew upgrade

cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/bundle'

# Version Control
brew 'git'
brew 'git-flow'
# brew 'uncrustify'

brew 'coreutils'
# brew 'moreutils'
brew 'cliclick'
# brew 'findutils'
# brew 'gnu-sed', args: ['with-default-names']
# brew 'bash'
# brew 'bash-completion'
# brew 'wget', args: ['with-iri']
# brew 'vim', args: ['override-system-vi']
brew 'grep'
brew 'screen'
brew 'brew-cask-completion'
brew 'tree'
# brew 'jenv'
# brew 'rbenv'
# brew 'pyenv'
brew 'npm'
brew 'nvm'
brew 'yarn'
brew 'docker'
brew 'postgresql'
#
# brew 'libgit2'
# brew 'openssl'
# brew 'unrar'

# Install some CTF tools; see https://github.com/ctfs/write-ups.
# brew 'bfg'
# brew 'binutils'
# brew 'binwalk'
# brew 'cifer'
# brew 'dex2jar'
# brew 'dns2tcp'
# brew 'fcrackzip'
# brew 'foremost'
# brew 'hashpump'
# brew 'hydra'
# brew 'john'
# brew 'knock'
# brew 'nmap'
# brew 'pngcheck'
# brew 'socat'
# brew 'sqlmap'
# brew 'tcpflow'
# brew 'tcpreplay'
# brew 'tcptrace'
# brew 'ucspi-tcp' # `tcpserver` etc.
# brew 'xpdf'
# brew 'xz'

# Install other useful binaries.
# brew 'ack'
# brew 'exiv2'
# brew 'imagemagick', args: ['with-webp']
# brew 'lua'
# brew 'lynx'
# brew 'p7zip'
# brew 'pigz'
# brew 'pv'
# brew 'rename'
# brew 'rhino'
# brew 'webkit2png'
# brew 'zopfli'

# cask 'gcc-arm-embedded'
cask '1password'
# cask 'lastpass'
# cask 'adium'
# cask 'atom'
# cask 'firefox'
# cask 'garmin-express'
# cask 'google-chrome'
cask 'brave-browser'
# cask 'handbrake'
# cask 'mapbox-studio'
# cask 'seashore'
cask 'slack'
# cask 'steam'
# cask 'transmission'
# cask 'tunnelbear'
 cask 'vlc'
# cask 'cocoapods'
cask 'notion'
cask 'messenger'
cask 'nordvpn'
cask 'spectacle'
cask 'alfred'
cask 'spotify'
# cask 'toggl-track'
cask 'freedom'
cask 'bartender'
cask 'loom'
cask 'visual-studio-code'
cask 'airtable'
cask 'parallels'
cask 'skype'
cask 'warp'
cask 'signal'

