# # Make sure we’re using the latest Homebrew
#brew update

# # Upgrade any already-installed formulae
#brew upgrade

cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/bundle'

# Version Control
brew 'git'
brew 'git-flow'

# https://github.com/jesseduffield/lazygit
# https://www.youtube.com/watch?v=CPLdltN7wgE
# https://github.com/akinsho/toggleterm.nvim#custom-terminal-usage
brew 'lazygit'
brew 'go' # needed for lazygit
# brew 'uncrustify'

# CLI Utils
brew 'coreutils'
brew 'moreutils'
brew 'findutils'

# CLI Applications
brew 'cliclick' # Control mouse vie CLI
brew 'grep'
brew 'screen'
brew 'brew-cask-completion'
brew 'tree'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'starship'
# brew 'gnu-sed', args: ['with-default-names']
# brew 'unrar'

# Software Development & Environment control
cask 'visual-studio-code'
brew 'gh'
brew 'nvim'
brew 'stylua'
brew 'ripgrep' # Needed for Nvim Telescope
brew 'fd' # Needed for Nvim Telescope
brew 'glow' # Needed for Nvim Telescope-repo
brew 'bat' # Needed for Nvim Telescope-repo
brew 'wget' # Needed for Nvim Mason
brew 'rust' # Needed for Nvim Mason
brew 'luarocks' # Needed for Nvim Mason
brew 'composer' # Needed for Nvim Mason
brew 'php' # Needed for Nvim Mason
brew 'lua-language-server'
brew 'yaml-language-server'
brew 'bash-language-server'
brew 'node'
# cask 'atom'
# cask 'cocoapods'
# brew 'jenv'
# brew 'rbenv'
# brew 'pyenv'
# brew 'npm'
# brew 'nvm'
# brew 'yarn'
# brew 'docker'
# brew 'postgresql'
# brew 'libgit2'
# brew 'openssl'
# cask 'gcc-arm-embedded'

# Browsers
cask 'brave-browser'
# cask 'microsoft-edge'
# cask 'firefox'
# cask 'google-chrome'

# Messangers & other communication
cask 'slack'
cask 'messenger'
cask 'signal'
cask 'skype'
cask 'discord'
cask 'zoom'
# cask 'adium'

# Video players & music
cask 'vlc'
cask 'iina'
cask 'spotify'

# Quality of life and productivity applications
cask '1password' # Password manager
cask 'spectacle' # Window manager
cask 'alfred' # Better Spotlight replacement
cask 'freedom' # Block apps and webcontet to focus on deep work
cask 'loom' # Screen recorder
# cask 'bartender'
# cask 'toggl-track'

# Networking Applications
cask 'nordvpn' # VPN
# cask 'transmission'
# cask 'tunnelbear'

# Other Applications
cask 'notion'
cask 'airtable'
cask 'parallels'
cask 'tempbox' # Temporary email inbox
cask 'shottr' # Screenshot application
cask 'hiddenbar' # Bartender like app to hide 'trayicons'
cask 'menubar-stats' # Shows system performance indicators on menubar
# cask 'handbrake' # Open-source video transcoder
# cask 'steam'

# Later.app https://github.com/alyssaxuu/later
# Raycast.app https://www.raycast.com/




########################################
# Install some CTF tools; see https://github.com/ctfs/write-ups.
# brew 'bfg'
# brew 'binutils'
# brew 'binwalk'
# brew 'cifer'
# brew 'dex2jar'
# brew 'dns2tcp'
# brew 'fcrackzip'
# brew 'foremost'
# brew 'hashpump'
# brew 'hydra'
# brew 'john'
# brew 'knock'
# brew 'nmap'
# brew 'pngcheck'
# brew 'socat'
# brew 'sqlmap'
# brew 'tcpflow'
# brew 'tcpreplay'
# brew 'tcptrace'
# brew 'ucspi-tcp' # `tcpserver` etc.
# brew 'xpdf'
# brew 'xz'

# Install other useful binaries.
brew 'ack'
brew 'youtube-dl'
# brew 'exiv2'
# brew 'imagemagick', args: ['with-webp']
# brew 'lua'
# brew 'lynx'
# brew 'p7zip'
# brew 'pigz'
# brew 'pv'
# brew 'rename'
# brew 'rhino'
# brew 'webkit2png'
# brew 'zopfli'

